[{
    "title": "Чужак",
    "text": "Жители небольшого городка в ужасе: кто-то зверски убил и изнасиловал одиннадцатилетнего Фрэнка Питерсона. И этот кто-то – школьный учитель и тренер бейсбольной команды Терри Мейтленд. Его видели с Фрэнком в день преступления, а отпечатки пальцев Мейтленда найдены на месте убийства. Детектив Ральф Андерсон арестовывает маньяка, не дожидаясь окончания важного бейсбольного матча. Но вместо чистосердечного раскаяния Мейтленд заявляет о невиновности. В момент убийства его не было в городе! Это подтверждают трое его коллег и записи видеокамер… Андерсону предстоит отделить правду от лжи и найти настоящего преступника, но для этого заядлому скептику придется поверить в существование сверхъестественного. Поверить, пока не стало слишком поздно.",
    "author": "Стивен Кинг",
    "ganre": "Зарубежные детективы, Мистика, Триллеры",
    "volume": "590 стр.",
    "date": "2018",
    "url" : "https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_415/40848833-stiven-king-chuzhak.jpg",
    "rating":{
        "litres": 4.4,
        "liveLib": 4.3
    }
},
{
    "title": "Ведьмак (сборник)",
    "text": "Геральт из Ривии – ведьмак, один из немногих представителей некогда большого и могущественного дома борцов с нечистью. Он один из лучших в своем деле, с детства наученный убивать упырей, ведьм, леших и всех, кто так или иначе угрожает людям. Но делает он это вовсе не из добрых побуждений. Ведьмак – это работа. А за работу, как известно, нужно платить. И не важно, требуется убить стрыгу в склепе или участвовать в политических интригах и человеческих войнах. Геральт знает цену собственного мастерства и своего не упустит. В сборник вошли все семь книг о ведьмаке Геральте – от «Последнего желания» до «Владычицы озера». Если вы играли в одноименные компьютерные игры, смотрели экранизации или просто слышали о Геральте из Ривии, купите, скачайте или читайте онлайн сборник Анджея Сапковского «Ведьмак» в сервисе электронных и аудиокниг №1 в России и СНГ ЛитРес. Первоисточник откроет перед вами много новых историй.",
    "author": "Анджей Сапковский",
    "ganre": "Боевое фэнтези, Героическое фэнтези, Зарубежное фэнтези",
    "volume": "2800 стр.",
    "date": "1993-1997, 1999",
    "url" : "https://cv6.litres.ru/pub/c/elektronnaya-kniga/cover_330/6375365-andzhey-sapkovskiy-vedmak.jpg",
    "rating":{
        "litres": 4.5,
        "liveLib": 4.7
    }
},
{
    "title": "Тонкое искусство пофигизма",
    "text": "Современное общество пропагандирует культ успеха: будь умнее, богаче, продуктивнее – будь лучше всех. Соцсети изобилуют историями на тему, как какой-то малец придумал приложение и заработал кучу денег, статьями в духе «Тысяча и один способ быть счастливым», а фото во френдленте создают впечатление, что окружающие живут лучше и интереснее, чем мы. Однако наша зацикленность на позитиве и успехе лишь напоминает о том, чего мы не достигли, о мечтах, которые не сбылись. Как же стать по-настоящему счастливым? Популярный блогер Марк Мэнсон в книге «Тонкое искусство пофигизма» предлагает свой, оригинальный подход к этому вопросу. Его жизненная философия проста – необходимо научиться искусству пофигизма. Определив то, до чего вам действительно есть дело, нужно уметь наплевать на все второстепенное, забить на трудности, послать к черту чужое мнение и быть готовым взглянуть в лицо неудачам и показать им средний палец.",
    "author": "Марк Мэнсон",
    "ganre": "Зарубежная психология, Саморазвитие / личностный рост, Социальная психология",
    "volume": "180 стр.  1 иллюстрация",
    "date": "2016",
    "url" : "https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_330/25440816-mark-menson-tonkoe-iskusstvo-pofigizma.jpg",
    "rating":{
        "litres": 4.2,
        "liveLib": 4.0
    }
},
{
    "title": "Эффективное использование потоков в операционной системе Android",
    "text": "Чтобы написать действительно полезное и удобное приложение для Android, то без многопоточности никак не обойтись, но как узнать о технологиях и методах, которые помогут решить такую задачу? Книга с практической точки зрения описывает несколько асинхронных механизмов, доступных в программной среде Android SDK, а также рассматривает основные принципы и правила выбора одного из них, лучше всего подходящего для создаваемого приложения. Издание предназначено для программистов разной квалификации, уже работающих под Android и желающих улучшить качество создаваемых программ.",
    "author": "Андерс Ёранссон",
    "ganre": "Зарубежная компьютерная литература, Зарубежная справочная литература, Программирование, Руководства",
    "volume": "314 стр.",
    "date": "2014",
    "url" : "https://cv8.litres.ru/pub/c/pdf-kniga/cover_330/22998682-anders-eransson-effektivnoe-ispolzovanie-potokov-v-operacionnoy-sisteme-android-22998682.jpg",
    "rating":{
        "litres": 5.0,
        "liveLib": null
    }
},

{
    "title": "Оно",
    "text": "Волна страшных убийств захватила небольшой американский город Дерри. Один за одним погибают дети, но полиция бессильна. Маньяк не оставляет следов, нет ни единой зацепки. Семеро одиннадцатилетних ребят решаются найти убийцу – жестокое нечто по имени Оно. Каждому из них предстоит пережить встречу с чудовищем, и никто из взрослых не придет на помощь. Ведь Оно – воплощение детских страхов, которое взрослые просто не способны увидеть. Читайте культовый роман Стивена Кинга в режиме онлайн или покупайте его в удобном формате на нашем сайте.",
    "author": "Стивен Кинг",
    "ganre": "Мистика, Ужасы",
    "volume": "530 стр. 2 иллюстрации",
    "date": "1986",
    "url" : "https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_330/122126-stiven-king-ono-122126.jpg",
    "rating":{
        "litres": 4.4,
        "liveLib": 4.4
    }
}
]
