[{
    "title": "Чужак",
    "text": "Жители небольшого городка в ужасе: кто-то зверски убил и изнасиловал одиннадцатилетнего Фрэнка Питерсона. И этот кто-то – школьный учитель и тренер бейсбольной команды Терри Мейтленд. Его видели с Фрэнком в день преступления, а отпечатки пальцев Мейтленда найдены на месте убийства. Детектив Ральф Андерсон арестовывает маньяка, не дожидаясь окончания важного бейсбольного матча. Но вместо чистосердечного раскаяния Мейтленд заявляет о невиновности. В момент убийства его не было в городе! Это подтверждают трое его коллег и записи видеокамер… Андерсону предстоит отделить правду от лжи и найти настоящего преступника, но для этого заядлому скептику придется поверить в существование сверхъестественного. Поверить, пока не стало слишком поздно.",
    "author": "Стивен Кинг",
    "ganre": "Зарубежные детективы, Мистика, Триллеры",
    "volume": "590 стр.",
    "date": "2018",
    "url" : "https://cdn1.ozone.ru/s3/multimedia-n/c650/6008237471.jpg",
    "rating":{
        "litres": 4.4,
        "liveLib": 4.3
    }
},
{
    "title": "Ведьмак (сборник)",
    "text": "Геральт из Ривии – ведьмак, один из немногих представителей некогда большого и могущественного дома борцов с нечистью. Он один из лучших в своем деле, с детства наученный убивать упырей, ведьм, леших и всех, кто так или иначе угрожает людям. Но делает он это вовсе не из добрых побуждений. Ведьмак – это работа. А за работу, как известно, нужно платить. И не важно, требуется убить стрыгу в склепе или участвовать в политических интригах и человеческих войнах. Геральт знает цену собственного мастерства и своего не упустит. В сборник вошли все семь книг о ведьмаке Геральте – от «Последнего желания» до «Владычицы озера». Если вы играли в одноименные компьютерные игры, смотрели экранизации или просто слышали о Геральте из Ривии, купите, скачайте или читайте онлайн сборник Анджея Сапковского «Ведьмак» в сервисе электронных и аудиокниг №1 в России и СНГ ЛитРес. Первоисточник откроет перед вами много новых историй.",
    "author": "Анджей Сапковский",
    "ganre": "Боевое фэнтези, Героическое фэнтези, Зарубежное фэнтези",
    "volume": "2800 стр.",
    "date": "1993-1997, 1999",
    "url" : "https://cv6.litres.ru/pub/c/elektronnaya-kniga/cover_330/6375365-andzhey-sapkovskiy-vedmak.jpg",
    "rating":{
        "litres": 4.5,
        "liveLib": 4.7
    }
},
{
    "title": "Тонкое искусство пофигизма",
    "text": "Современное общество пропагандирует культ успеха: будь умнее, богаче, продуктивнее – будь лучше всех. Соцсети изобилуют историями на тему, как какой-то малец придумал приложение и заработал кучу денег, статьями в духе «Тысяча и один способ быть счастливым», а фото во френдленте создают впечатление, что окружающие живут лучше и интереснее, чем мы. Однако наша зацикленность на позитиве и успехе лишь напоминает о том, чего мы не достигли, о мечтах, которые не сбылись. Как же стать по-настоящему счастливым? Популярный блогер Марк Мэнсон в книге «Тонкое искусство пофигизма» предлагает свой, оригинальный подход к этому вопросу. Его жизненная философия проста – необходимо научиться искусству пофигизма. Определив то, до чего вам действительно есть дело, нужно уметь наплевать на все второстепенное, забить на трудности, послать к черту чужое мнение и быть готовым взглянуть в лицо неудачам и показать им средний палец.",
    "author": "Марк Мэнсон",
    "ganre": "Зарубежная психология, Саморазвитие / личностный рост, Социальная психология",
    "volume": "180 стр.  1 иллюстрация",
    "date": "2016",
    "url" : "https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_330/25440816-mark-menson-tonkoe-iskusstvo-pofigizma.jpg",
    "rating":{
        "litres": 4.2,
        "liveLib": 4.0
    }
},
{
    "title": "Эффективное использование потоков в операционной системе Android",
    "text": "Чтобы написать действительно полезное и удобное приложение для Android, то без многопоточности никак не обойтись, но как узнать о технологиях и методах, которые помогут решить такую задачу? Книга с практической точки зрения описывает несколько асинхронных механизмов, доступных в программной среде Android SDK, а также рассматривает основные принципы и правила выбора одного из них, лучше всего подходящего для создаваемого приложения. Издание предназначено для программистов разной квалификации, уже работающих под Android и желающих улучшить качество создаваемых программ.",
    "author": "Андерс Ёранссон",
    "ganre": "Зарубежная компьютерная литература, Зарубежная справочная литература, Программирование, Руководства",
    "volume": "314 стр.",
    "date": "2014",
    "url" : "https://cv8.litres.ru/pub/c/pdf-kniga/cover_330/22998682-anders-eransson-effektivnoe-ispolzovanie-potokov-v-operacionnoy-sisteme-android-22998682.jpg",
    "rating":{
        "litres": 5.0,
        "liveLib": null
    }
},
{
    "title": "Kotlin в действии",
    "text": "Язык Kotlin предлагает выразительный синтаксис, мощную и понятную систему типов, великолепную поддержку и бесшовную совместимость с существующим кодом на Java, богатый выбор библиотек и фреймворков. Kotlin может компилироваться в байт-код Java, поэтому его можно использовать везде, где используется Java, включая Android. А благодаря эффективному компилятору и маленькой стандартной библиотеке Kotlin практически не привносит накладных расходов. Данная книга научит вас пользоваться языком Kotlin для создания высококачественных приложений. Написанная создателями языка – разработчиками в компании JetBrains, – эта книга охватывает такие темы, как создание предметно-ориентированных языков, функциональное программирование в JVM, совместное использование Java и Kotlin и др. Издание предназначено разработчикам, владеющим языком Java и желающим познакомиться и начать эффективно работать с Kotlin.",
    "author": "Дмитрий Жемеров, Светлана Исакова",
    "ganre": "Зарубежная компьютерная литература, Программирование",
    "volume": "404 стр.",
    "date": "2017",
    "url" : "https://cv6.litres.ru/pub/c/pdf-kniga/cover_330/27069061-dmitriy-zhemerov-kotlin-v-deystvii-27069061.jpg",
    "rating":{
        "litres": 4.3,
        "liveLib": null
    }
},
{
    "title": "Реактивное программирование с применением RxJava",
    "text": "В наши дни, когда программы асинхронны, а быстрая реакция – важнейшее свойство, реактивное программирование поможет писать более надежный, лучше масштабируемый и быстрее работающий код. Благодаря этой книге программист на Java узнает о реактивном подходе к задачам и научится создавать программы, вобравшие в себя лучшие черты этой новой и весьма перспективной парадигмы. Данная книга содержит глубокое и подробное изложение концепций и принципов использования реактивного программирования вообще и RxJava в частности. Книга может использоваться как для последовательного изучения предмета, так и в качестве справочника по библиотеке.",
    "author": "Бен Кристенсен, Томаш Нуркевич",
    "ganre": "Зарубежная компьютерная литература, Программирование",
    "volume": "360 стр.",
    "date": "2017",
    "url" : "https://cv8.litres.ru/pub/c/pdf-kniga/cover_330/27069080-ben-kristensen-reaktivnoe-programmirovanie-s-primeneniem-rxjava-27069080.jpg",
    "rating":{
        "litres": 4.2,
        "liveLib": null
    }
},
{
    "title": "Чистый код: создание, анализ и рефакторинг",
    "text": "Даже плохой программный код может работать. Однако если код не является «чистым», это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и «укрощение» Эта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший. Книга состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги – концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и «запахов кода», собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.",
    "author": "Роберт Мартин",
    "ganre": "Зарубежная компьютерная литература, Программирование",
    "volume": "464 стр.",
    "date": "2018",
    "url" : "https://cv7.litres.ru/pub/c/pdf-kniga/cover_330/6444478-robert-s-martin-chistyy-kod-sozdanie-analiz-i-refaktoring-6444478.jpg",
    "rating":{
        "litres": 4.2,
        "liveLib": null
    }
},
{
    "title": "Современный Java: рецепты программирования",
    "text": "Эта книга представляет собой рецепты программирования на языке Java, описывающие нововведения версий 8 и 9. В книге вы найдете массу примеров кода, демонстрирующих почти все обсуждаемые языковые и библиотечные средства. Эти примеры намеренно сделаны как можно более простыми, чтобы сосредоточиться на основных отличительных моментах. Все они могут послужить вам неплохой отправной точкой для разработки собственного кода. Издание будет полезно опытным программистам, уже работающим на Java.",
    "author": "Кен Коузен",
    "ganre": "Зарубежная компьютерная литература, Программирование",
    "volume": "276 стр.",
    "date": "2017",
    "url" : "https://cv8.litres.ru/pub/c/pdf-kniga/cover_330/45670184-ken-kouzen-sovremennyy-java-recepty-programmirovaniya-45670184.jpg",
    "rating":{
        "litres": null,
        "liveLib": null
    }
},
{
    "title": "Стив Джобс",
    "text": "В основу этой биографии легли беседы с самим Стивом Джобсом, а также с его родственниками, друзьями, врагами, соперниками и коллегами. Джобс никак не контролировал автора. Он откровенно отвечал на все вопросы и ждал такой же честности от остальных. Это рассказ о жизни, полной падений и взлетов, о сильном человеке и талантливом бизнесмене, который одним из первых понял: чтобы добиться успеха в XXI веке, нужно соединить креативность и технологии.",
    "author": "Уолтер Айзексон",
    "ganre": "Биографии и мемуары, Зарубежная публицистика, Истории успеха",
    "volume": "840 стр. 29 иллюстраций",
    "date": "2011",
    "url" : "https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_330/2691335-uolter-ayzekson-stiv-dzhobs.jpg",
    "rating":{
        "litres": 4.6,
        "liveLib": 4.5
    }
},
{
    "title": "Продавец обуви. История компании Nike, рассказанная ее основателем",
    "text": "Nike – один из самых узнаваемых мировых брендов. Создатель компании – Фил Найт – один из богатейших людей, хотя еще в юности он не мог себе позволить купить кроссовки Adidas. 50 лет назад студент Орегонского университета и бегун на средние дистанции Фил Найт занял у отца 50 баксов и начал перепродавать кроссовки из Японии. Сегодня годовой оборот компании Nike составляет 30 миллиардов долларов. А пара «найков» найдется в шкафу у каждого – от президента до подростка. Фил Найт – человек-загадка, он редко дает интервью. Эта книга – исповедь о создании компании, которой удалось подарить мечту миллионам людей.",
    "author": "Фил Найт",
    "ganre": "Биографии и мемуары, Зарубежная деловая литература, Зарубежная публицистика, Истории успеха, Просто о бизнесе",
    "volume": "520 стр. 1 иллюстрация",
    "date": "2016",
    "url" : "https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_330/22101218-fil-nayt-prodavec-obuvi-istoriya-kompanii-nike-rasskazannaya-ee-osnovatelem.jpg",
    "rating":{
        "litres": 4.7,
        "liveLib": 4.6
    }
},

{
    "title": "Оно",
    "text": "Волна страшных убийств захватила небольшой американский город Дерри. Один за одним погибают дети, но полиция бессильна. Маньяк не оставляет следов, нет ни единой зацепки. Семеро одиннадцатилетних ребят решаются найти убийцу – жестокое нечто по имени Оно. Каждому из них предстоит пережить встречу с чудовищем, и никто из взрослых не придет на помощь. Ведь Оно – воплощение детских страхов, которое взрослые просто не способны увидеть. Читайте культовый роман Стивена Кинга в режиме онлайн или покупайте его в удобном формате на нашем сайте.",
    "author": "Стивен Кинг",
    "ganre": "Мистика, Ужасы",
    "volume": "530 стр. 2 иллюстрации",
    "date": "1986",
    "url" : "https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_330/122126-stiven-king-ono-122126.jpg",
    "rating":{
        "litres": 4.4,
        "liveLib": 4.4
    }
}
]
